{"title":"Hold Please","date":"2015-02-10T01:25:36+00:00","body":"<p>The canonical example for an ActiveRecord callback is sending a welcome email after a <code>User</code> is created.</p>\n<pre class=\"highlight ruby\"><code><span class=\"k\">class</span> <span class=\"nc\">User</span> <span class=\"o\">&lt;</span> <span class=\"no\">ActiveRecord</span><span class=\"o\">::</span><span class=\"no\">Base</span>\n\n  <span class=\"n\">after_create</span> <span class=\"ss\">:send_welcome_email</span>\n\n<span class=\"kp\">private</span>\n\n  <span class=\"k\">def</span> <span class=\"nf\">send_welcome_email</span>\n    <span class=\"no\">UserMailer</span><span class=\"p\">.</span><span class=\"nf\">welcome_email</span><span class=\"p\">.</span><span class=\"nf\">deliver</span>\n  <span class=\"k\">end</span>\n\n<span class=\"k\">end</span>\n</code></pre>\n\n<p>I remember how awesome that felt the first time. It seemed like such great design. I was fat-modeling, skinny-controllering with the best of them. But the joy didn’t last long.</p>\n\n<p>One time, I manually created a bunch of users from the console in production. The intention was to set up their accounts and then personally send them an email inviting them to try out the product. But before I could do that I started getting confused emails asking why they’d been signed up for some product they’d never heard of. It hadn’t occurred to me that the welcome emails would be sent if I created users from the console.</p>\n\n<p>Another time, I was trying to speed up an agonizingly slow test suite. Out of curiosity I commented out the welcome email callback on <code>User</code>. The test suite ran 10 seconds or so faster. It hadn’t occurred to me that every time a user was created in a test it would send a mailer to the test delivery queue, and that all that time would add up to a significant amount.</p>\n\n<p>I don’t mean to specifically pick on sending emails in a callback, that’s just a really common example. It could be changing an attribute before saving or even creating an associated record. The point is that when you use an ActiveRecord callback you&rsquo;re saying you <em>always</em> want it to run <em>every</em> time. But that&rsquo;s not what I really wanted.</p>\n\n<p>I didn&rsquo;t want a welcome email to be sent if I created a user from the console. I didn&rsquo;t want a welcome email to be sent every time a user was created in a test. I really only wanted a welcome email to be sent when a user signed up. Which means the right place to send the email was in the controller, where it was in the first place before I tried to get clever.</p>\n\n<p>Almost every ActiveRecord callback I&rsquo;ve ever written I eventually removed later on after I realized it was actually contextual—it had only <em>seemed</em> like it should always run. Now I just don’t use them at all any more.</p>\n\n<p>Inspired by <a href=\"https://www.destroyallsoftware.com/screencasts\">Gary Bernhardt’s</a> gem <a href=\"https://github.com/garybernhardt/do_not_want\">Do Not Want</a> I wrote a gem that codified my intent not to use them. It’s called <a href=\"https://github.com/brandonweiss/hold_please\">Hold Please</a> and it will raise an exception if you or anyone else tries to use an ActiveRecord callback. As you’d expect it will allow third-party gems to use them so they don’t break.</p>\n\n<p>If you want to ensure you don’t inadvertently relapse and prevent anyone else on your project from doing the same, check out <a href=\"https://github.com/brandonweiss/hold_please\">Hold Please</a>.</p>\n\n<p>Enjoy your saner future.</p>\n"}